In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r'data/ds_salaries.csv')

### PREPROCESAMIENTO

In [3]:
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [4]:
df.columns #saber las columnas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [5]:
df.shape #saber las dimensiones

(3755, 11)

In [6]:
df.dtypes #saber los tipos de datos

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [7]:
df.isnull().sum() #saber los valores nulos

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [8]:
df.duplicated().sum() #saber los valores duplicados

1171

In [9]:
duplicados=pd.DataFrame(df.value_counts())
duplicados[duplicados['count']>1]

                                                                                                                                                                    count
work_year experience_level employment_type job_title            salary salary_currency salary_in_usd employee_residence remote_ratio company_location company_size
2022      SE               FT              Data Scientist       191475 USD             191475        US                 100          US               M                21
                                                                141525 USD             141525        US                 100          US               M                21
2023      SE               FT              Data Engineer        252000 USD             252000        US                 0            US               M                13
                                                                129000 USD             129000        US                 0            US               M                13
2022      SE               FT              Data Engineer        130000 USD             130000        US                 0            US               M                12
...                                                                                                                                                                   ...
                                           Data Scientist       119300 USD             119300        US                 0            US               L                 2
2023      SE               FT              Data Quality Analyst 100000 USD             100000        US                 0            US               M                 2
                                                                80000  USD             80000         US                 0            US               M                 2
2022      EN               FT              Data Analyst         50000  USD             50000         US                 50           US               L                 2
2023      MI               FT              Data Analyst         85000  USD             85000         US                 0            US               M                 2

[544 rows x 1 columns]

In [10]:
df.drop_duplicates(inplace=True) #eliminar duplicados

In [11]:
df.shape

(2584, 11)

### EDA

In [12]:
df.head(1)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L

en que pais estan las compañias mas grandes

In [13]:
paises=[]
for i in range(len(df)):
    if df.iloc[i]['company_size']=='L':
        paises.append(((df.iloc[i]['company_location'])))

(pd.DataFrame(paises).value_counts().head(5))

0
US    220
IN     37
GB     20
CA     18
DE     16
Name: count, dtype: int64

En que puesto se gana mas

In [14]:
df.groupby(['job_title']).agg({'salary_in_usd':'mean'}).round(2).sort_values(by='salary_in_usd',ascending=False).head()

                          salary_in_usd
job_title
Data Science Tech Lead        375000.00
Cloud Data Architect          250000.00
Data Lead                     212500.00
Data Analytics Lead           211254.50
Principal Data Scientist      198171.12

pais de residencia donde mas se cobra?

In [22]:
df.groupby(['employee_residence']).agg({'salary_in_usd':'mean'}).round(2).sort_values(by='salary_in_usd',ascending=False).head()

                    salary_in_usd
employee_residence
IL                      423834.00
MY                      200000.00
PR                      166000.00
US                      153972.21
CA                      130859.84

tipo de trabajo donde mas se cobra

In [16]:
df.groupby(['employment_type']).agg({'salary_in_usd':'mean'}).round(2).sort_values(by='salary_in_usd',ascending=False)

                 salary_in_usd
employment_type
FT                   134434.61
CT                   113446.90
FL                    51807.80
PT                    39533.71

cuanto se cobra de media por cada nivel de experiencia?

In [17]:
df.groupby(['experience_level']).agg({'salary_in_usd':'mean'}).round(2).sort_values(by='salary_in_usd',ascending=False)

                  salary_in_usd
experience_level
EX                    191078.21
SE                    153897.44
MI                    101828.78
EN                     72648.69

en qué tamaño de compañía trabajan más

In [18]:
df['company_size'].value_counts().sort_values(ascending=False)

company_size
M    2028
L     409
S     147
Name: count, dtype: int64

en que tamaño de compañias trabajan mas 'Data Engineer'

In [19]:
df[df['job_title']=='Data Engineer'].groupby('company_size')['job_title'].value_counts()

company_size  job_title
L             Data Engineer     67
M             Data Engineer    523
S             Data Engineer      8
Name: count, dtype: int64

en que pais se cobra  mas por tipo de empleo?

In [20]:
df.groupby(['company_location','job_title']).agg({'salary_in_usd':'mean'}).round(2).sort_values(by=['salary_in_usd','job_title'],ascending=False)

                                                salary_in_usd
company_location job_title
IL               AI Scientist                        423834.0
US               Data Analytics Lead                 405000.0
                 Data Science Tech Lead              375000.0
IN               AI Developer                        300000.0
US               Director of Data Science            294375.0
...                                                       ...
CH               Big Data Engineer                     5882.0
IN               Data Science Consultant               5707.0
                 Power BI Developer                    5409.0
                 3D Computer Vision Researcher         5409.0
CZ               NLP Engineer                          5132.0

[356 rows x 1 columns]

wich are experience level more required

In [21]:
df['experience_level'].value_counts()

experience_level
SE    1554
MI     664
EN     270
EX      96
Name: count, dtype: int64

cuáles se repiten más en este set de datos, las empresas medianas, grandes o pequeñas